linktower.org

#+OPTIONS: html-postamble:nil
#+TITLE: linktower source code


* Introduction

This document describes linktower, a web application for storing and
organzing links. The description is both natural language and
executable code; in other words, a /literate program/. linktower is
like a pastebin site, but unlike
most pastebin sites, it provides functionality for exploring
what other users have posted.

** Overview

The site is implemented as a simple Flask application with no
dependencies except for what come with Flask. Since I'm more
interested in functionality than appearance at the moment, the
frontend is plain, unstyled html. The backend uses sqlite as the
database and directly queries it with plain sql. I deliberately chose
to forgo an ORM mostly to better familiarize myself with sql.

** Nomenclature

To stick with one conceptual theme, I use the following terms:
- *room:* a collection of links and labels
- *floor:* a collection of rooms
- *door:* a link from a room to another room or floor (i.e. an internal link)


 

* Imports

#+begin_src python :tangle app.py
from flask import Flask, render_template, request, g, redirect, url_for, send_from_directory
from werkzeug.security import generate_password_hash, check_password_hash
import sqlite3
import random
import string
from urllib.parse import urlparse
app = Flask(__name__)  
#+end_src

* The Database and Methods to Interact with it

** Schema


The central concept in this application /Room/. A room is a
collection of links that has a title, creator, and password. In order
to edit or delete a room, the creator and  password must be
provided. A new password can be set when editing a room. Additionally,
a randomly generated url slug where the room can be found is store
(i.e. room/<creator/<slug>). Rooms have links and domains, which are
described below.

#+begin_src sql :tangle schema.sql
DROP TABLE IF EXISTS Rooms;
CREATE TABLE Rooms (
    id INTEGER PRIMARY KEY autoincrement,
    title TEXT NOT NULL,
    floor_name TEXT NOT NULL,
    slug TEXT NOT NULL,
    password_hash TEXT NOT NULL
);

#+end_src 


The url of a link *MUST* start with https:// or http://. Although I could split the description into its own table (since the
same link can have more than one description), I figured that the
overlap of links between rooms would be small, so some redundancy is
allowed in order to simplify the schema somewhat. Each link can also
have zero or one labels (no label will be the empty string ''), which
allows users to organize their room somewhat. Rooms and Links have a
one-to-man relationship (one room has multiple links, each link
belongs to one room. The domain name is stored in addition to the url
in order to simplify finding rooms by what domains they list (e.g.,
find all rooms that have a link to example.com)

#+begin_src sql :tangle schema.sql
DROP TABLE IF EXISTS Links;
CREATE TABLE Links (
    id INTEGER PRIMARY KEY autoincrement,
    url TEXT NOT NULL,
    domainName TEXT NOT NULL,
    description TEXT NOT NULL,
    label TEXT NOT NULL,
    room_id INTEGER NOT NULL,
    FOREIGN KEY (room_id) REFERENCES Rooms(id)
);
#+end_src


In order to initialize the database, the command ~sqlite filename.db <
schema.sql~ is run on the command line.


** Connecting to and Querying the Database From Python

 This task is thoroughly covered in [[https://flask.palletsprojects.com/en/2.2.x/patterns/sqlite3/][the Flask documentation.]]

*** open\under{}db
 
The ~open_db~ function is a helper for ~query_db~ below. The line ~db.row_factory = sqlite3.Row~ lets us read the row into a
python dictionary instead of a plain tuple, which allows access to the
data based on column names rather than numeric indices. According to
[[https://docs.python.org/3/library/sqlite3.html#sqlite3-howto-row-factory][the python sqlite documentation]] there is little overhead for
this. The database connection itself is stored in Flask's global
variable ~g~. Among other things, this means we don't have to open a
new connectione every time we query the database.

#+begin_src python :tangle app.py
def open_db():
    db = getattr(g, '_database', None)
    if db is None:
        db = g._database = sqlite3.connect("test.db")
        db.row_factory = sqlite3.Row
    return db
#+end_src

*** query\under{}db


A list of dicts is returned from execution, which can be iterated over by the
caller. *Additionally, the id of the last inserted row is returned*
(~results,_ = ...~ is used when the id is not needed). This saves having to
immediately query the database for the thing we just inserted.
#+begin_src python :tangle app.py

def query_db(query, args=()):
    '''
    Returns a list of dicts of column name to value
    '''
    db = open_db()
    cur = db.cursor()
    # Turn on foreign key support as per https://sqlite.org/foreignkeys.html
    cur.execute("PRAGMA foreign_keys=ON")
    cur.execute(query, args)
    id = cur.lastrowid
    rv = cur.fetchall()
    cur.close()
    return rv,id
#+end_src 

