linktower.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-24 Tue 15:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linktower source code</title>
<meta name="author" content="dg" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">linktower source code</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga93b92a">1. Introduction</a>
<ul>
<li><a href="#org3bbb624">1.1. Overview</a></li>
<li><a href="#org9c1cd31">1.2. Nomenclature</a></li>
</ul>
</li>
<li><a href="#org594752d">2. Imports</a></li>
<li><a href="#orgd2c337f">3. The Database and Methods to Interact with it</a>
<ul>
<li><a href="#org5f68dff">3.1. Schema</a></li>
<li><a href="#orgaeece57">3.2. Connecting to and Querying the Database From Python</a>
<ul>
<li><a href="#org2de03a4">3.2.1. open_db</a></li>
<li><a href="#org62c6574">3.2.2. query_db</a></li>
<li><a href="#org8e8b42d">3.2.3. close_connection</a></li>
</ul>
</li>
<li><a href="#orgf129b52">3.3. Methods that Query the Database</a>
<ul>
<li><a href="#orge8f4dc4">3.3.1. Insert Room</a></li>
<li><a href="#org210addd">3.3.2. Update Room</a></li>
<li><a href="#orgd58ee1e">3.3.3. Delete Room</a></li>
<li><a href="#org19d8e5b">3.3.4. Generating Room URL Slugs</a></li>
<li><a href="#orgf914589">3.3.5. Verify Floor Names</a></li>
<li><a href="#org2001b26">3.3.6. Getters</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org97c44fb">4. Routes</a>
<ul>
<li><a href="#orgafcacdb">4.1. Static Pages</a>
<ul>
<li><a href="#org8cebd44">4.1.1. Home</a></li>
<li><a href="#org039bc27">4.1.2. Help</a></li>
<li><a href="#orga61e347">4.1.3. Source code</a></li>
</ul>
</li>
<li><a href="#org9698535">4.2. New Room Form (GET)</a></li>
<li><a href="#org364a02b">4.3. New Room Form (POST)</a></li>
<li><a href="#org48ff057">4.4. View Room</a></li>
<li><a href="#orgea7aaef">4.5. Edit Room Form (GET)</a></li>
<li><a href="#orgc20d917">4.6. Edit Room Form (POST)</a>
<ul>
<li><a href="#org0714450">4.6.1. Diffing Links</a></li>
</ul>
</li>
<li><a href="#orgd5e160d">4.7. Delete Room (GET)</a></li>
<li><a href="#org086ef9f">4.8. Delete Room (POST)</a></li>
<li><a href="#org5c1eb3c">4.9. Show All Rooms on Floor</a></li>
<li><a href="#org8a5bbe2">4.10. Discover (GET)</a></li>
<li><a href="#org90b541e">4.11. Discover (POST)</a></li>
</ul>
</li>
<li><a href="#orgf71fd86">5. Helper Methods</a>
<ul>
<li><a href="#org7db789f">5.1. Parsing the Links Form</a></li>
<li><a href="#org75ff060">5.2. Associated Each Label to its Links</a></li>
<li><a href="#org5ef15a8">5.3. Check Form Validity</a></li>
</ul>
</li>
<li><a href="#orgbcd0757">6. Views</a>
<ul>
<li><a href="#org0aff726">6.1. Base Template</a></li>
<li><a href="#orgd4a6dca">6.2. Form Template</a>
<ul>
<li><a href="#org19dcfcc">6.2.1. New Form</a></li>
<li><a href="#orge7dbaba">6.2.2. Edit Form</a></li>
</ul>
</li>
<li><a href="#org1bddb25">6.3. Room Template</a></li>
<li><a href="#orgb103cc1">6.4. Delete Room</a></li>
<li><a href="#orgddad503">6.5. Floor Template</a></li>
<li><a href="#orge841e12">6.6. Discover</a></li>
<li><a href="#org2a851a7">6.7. Homepage</a></li>
<li><a href="#orgb69c88d">6.8. Help</a></li>
<li><a href="#orga757ef7">6.9. Error page</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orga93b92a" class="outline-2">
<h2 id="orga93b92a"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document describes linktower, a web application for storing and
organzing links. The description is both natural language and
executable code; in other words, a <i>literate program</i>. linktower is
like a pastebin site, but unlike
most pastebin sites, it provides functionality for exploring
what other users have posted.
</p>
</div>

<div id="outline-container-org3bbb624" class="outline-3">
<h3 id="org3bbb624"><span class="section-number-3">1.1.</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The site is implemented as a simple Flask application with no
dependencies except for what come with Flask. Since I'm more
interested in functionality than appearance at the moment, the
frontend is plain, unstyled html. The backend uses sqlite as the
database and directly queries it with plain sql. I deliberately chose
to forgo an ORM mostly to better familiarize myself with sql.
</p>
</div>
</div>

<div id="outline-container-org9c1cd31" class="outline-3">
<h3 id="org9c1cd31"><span class="section-number-3">1.2.</span> Nomenclature</h3>
<div class="outline-text-3" id="text-1-2">
<p>
To stick with one conceptual theme, I use the following terms:
</p>
<ul class="org-ul">
<li><b>room:</b> a collection of links and labels</li>
<li><b>floor:</b> a collection of rooms</li>
<li><b>door:</b> a link from a room to another room or floor (i.e. an internal link)</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org594752d" class="outline-2">
<h2 id="org594752d"><span class="section-number-2">2.</span> Imports</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-python">from flask import Flask, render_template, request, g, redirect, url_for, send_from_directory
from werkzeug.security import generate_password_hash, check_password_hash
import sqlite3
import random
import string
from urllib.parse import urlparse
app = Flask(__name__)  
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd2c337f" class="outline-2">
<h2 id="orgd2c337f"><span class="section-number-2">3.</span> The Database and Methods to Interact with it</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5f68dff" class="outline-3">
<h3 id="org5f68dff"><span class="section-number-3">3.1.</span> Schema</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The central concept in this application <i>Room</i>. A room is a
collection of links that has a title, creator, and password. In order
to edit or delete a room, the creator and  password must be
provided. A new password can be set when editing a room. Additionally,
a randomly generated url slug where the room can be found is store
(i.e. room/&lt;creator/&lt;slug&gt;). Rooms have links and domains, which are
described below.
</p>

<div class="org-src-container">
<pre class="src src-sql">DROP TABLE IF EXISTS Rooms;
CREATE TABLE Rooms (
    id INTEGER PRIMARY KEY autoincrement,
    title TEXT NOT NULL,
    floor_name TEXT NOT NULL,
    slug TEXT NOT NULL,
    password_hash TEXT NOT NULL
);

</pre>
</div>


<p>
The url of a link <b>MUST</b> start with <a href="https://">https://</a> or <a href="http://">http://</a>. Although I could split the description into its own table (since the
same link can have more than one description), I figured that the
overlap of links between rooms would be small, so some redundancy is
allowed in order to simplify the schema somewhat. Each link can also
have zero or one labels (no label will be the empty string ''), which
allows users to organize their room somewhat. Rooms and Links have a
one-to-man relationship (one room has multiple links, each link
belongs to one room. The domain name is stored in addition to the url
in order to simplify finding rooms by what domains they list (e.g.,
find all rooms that have a link to example.com)
</p>

<div class="org-src-container">
<pre class="src src-sql">DROP TABLE IF EXISTS Links;
CREATE TABLE Links (
    id INTEGER PRIMARY KEY autoincrement,
    url TEXT NOT NULL,
    domainName TEXT NOT NULL,
    description TEXT NOT NULL,
    label TEXT NOT NULL,
    room_id INTEGER NOT NULL,
    FOREIGN KEY (room_id) REFERENCES Rooms(id)
);
</pre>
</div>


<p>
In order to initialize the database, the command <code>sqlite filename.db &lt;
schema.sql</code> is run on the command line.
</p>
</div>
</div>


<div id="outline-container-orgaeece57" class="outline-3">
<h3 id="orgaeece57"><span class="section-number-3">3.2.</span> Connecting to and Querying the Database From Python</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This task is thoroughly covered in <a href="https://flask.palletsprojects.com/en/2.2.x/patterns/sqlite3/">the Flask documentation.</a>
</p>
</div>

<div id="outline-container-org2de03a4" class="outline-4">
<h4 id="org2de03a4"><span class="section-number-4">3.2.1.</span> open_db</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
The <code>open_db</code> function is a helper for <code>query_db</code> below. The line <code>db.row_factory = sqlite3.Row</code> lets us read the row into a
python dictionary instead of a plain tuple, which allows access to the
data based on column names rather than numeric indices. According to
<a href="https://docs.python.org/3/library/sqlite3.html#sqlite3-howto-row-factory">the python sqlite documentation</a> there is little overhead for
this. The database connection itself is stored in Flask's global
variable <code>g</code>. Among other things, this means we don't have to open a
new connectione every time we query the database.
</p>

<div class="org-src-container">
<pre class="src src-python">def open_db():
    db = getattr(g, '_database', None)
    if db is None:
        db = g._database = sqlite3.connect("test.db")
        db.row_factory = sqlite3.Row
    return db
</pre>
</div>
</div>
</div>

<div id="outline-container-org62c6574" class="outline-4">
<h4 id="org62c6574"><span class="section-number-4">3.2.2.</span> query_db</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
A list of dicts is returned from execution, which can be iterated over by the
caller. <b>Additionally, the id of the last inserted row is returned</b>
(<code>results,_ = ...</code> is used when the id is not needed). This saves having to
immediately query the database for the thing we just inserted.
</p>
<div class="org-src-container">
<pre class="src src-python">
def query_db(query, args=()):
    '''
    Returns a list of dicts of column name to value
    '''
    db = open_db()
    cur = db.cursor()
    # Turn on foreign key support as per https://sqlite.org/foreignkeys.html
    cur.execute("PRAGMA foreign_keys=ON")
    cur.execute(query, args)
    id = cur.lastrowid
    rv = cur.fetchall()
    cur.close()
    return rv,id
</pre>
</div>
</div>
</div>
