linktower.org
*** close\under{}connection

The database connection is after Flask finishes the request. At this
point changes to the database are
committed 

#+begin_src python :tangle app.py
@app.teardown_appcontext
def close_connection(exception):
    db = getattr(g, '_database', None)
    if db is not None:
        db.commit()
        db.close()
        
#+end_src 

** Methods that Query the Database

*** Insert Room
The room is created first and the resulting room_id is used when
creating the link entries

#+name: insert_room_in_db
#+begin_src python :tangle app.py 
def insert_room_in_db(roomTitle, roomFloor_Name, roomPassword, labelToLinks, slug):
    password_hash =generate_password_hash(roomPassword)
    insertRoomQuery = '''
    INSERT INTO Rooms(title, floor_name, slug, password_hash)
    VALUES (:title, :floor_name, :slug, :password_hash);
    '''
    
    _, room_id = query_db(insertRoomQuery,
                     {"title":roomTitle, "floor_name":roomFloor_Name,
                      "slug":slug, "password_hash": password_hash})    

    insertLinkQuery = '''
    INSERT INTO Links (url, domainName, description, label, room_id)
    VALUES (:url, :domainName, :description, :label, :room_id);
    '''
    for label, links in labelToLinks.items():
        for link in links:
            domainName = urlparse(link['url']).netloc
            query_db(insertLinkQuery,
                     {'url':link['url'], 'domainName':domainName, 'description':link['description'],
                      'label':label,'room_id':room_id})
#+end_src

*** Update Room

The record in the Rooms table is updated if there is a change in one
of the fields, otherwise it is unmodified.

Links whose label, description, or url are changed are deleted, and
the updated version is inserted. 
#+begin_src python :tangle app.py
def update_room_in_db(changedRoomInfo, addedLinks, removedLinks, roomId):

    updateTitleQuery = '''
    UPDATE Rooms
    SET title = :value
    WHERE id = :room_id
    '''
    updateFloorNameQuery = '''
    UPDATE Rooms
    SET floor_name  = :value
    WHERE id = :room_id
    '''
    updatePasswordQuery = '''
    UPDATE Rooms
    SET password_hash = :value
    WHERE id = :room_id
    '''
    if 'title' in changedRoomInfo:
        query_db(updateTitleQuery, {'value':changedRoomInfo['title'], 'room_id':roomId})
    if 'floor_name' in changedRoomInfo:
        query_db(updateFloorNameQuery, {'value':changedRoomInfo['floor_name'], 'room_id':roomId})
    if 'password' in changedRoomInfo:
        query_db(updatePasswordQuery,{'value':generate_password_hash(changedRoomInfo['password']),'room_id':roomId})
       

    deleteLinkQuery = '''
    DELETE FROM Links
    WHERE url = :url
    AND room_id = :room_id;
    
    '''
    for link in removedLinks:
        query_db(deleteLinkQuery, {'url':link['url'], 'room_id':roomId})

        
    insertLinkQuery = '''
    INSERT INTO Links (url, domainName, description, label, room_id)
    VALUES (:url, :domainName, :description, :label, :room_id);
    '''
    for link in addedLinks:
        #insert links
        domainName = urlparse(link['url']).netloc
        query_db(insertLinkQuery,
                     {'url':link['url'], 'domainName':domainName, 'description':link['description'],
                      'label':link['label'],'room_id':roomId})    
#+end_src

*** Delete Room

#+begin_src python :tangle app.py
def delete_room(room_id):
    deleteLinksQuery = '''
    DELETE FROM Links
    WHERE room_id = :room_id;
    '''
    query_db(deleteLinksQuery, {'room_id':room_id})

    deleteRoomQuery = '''
    DELETE FROM Rooms
    WHERE id = :room_id;
    '''
    query_db(deleteRoomQuery, {'room_id':room_id})


    
#+end_src

*** Generating Room URL Slugs

A room slug is 8 random lowercase letters, which works out to
208,827,064,576 unique options. Although collision is practically
impossible at this scale, I'm going to check anyway.

#+begin_src python :tangle app.py
def create_room_slug():
    getSlugsQuery = '''
    SELECT slug FROM Rooms;
    '''
    results,_ = query_db(getSlugsQuery)
    slugs = [result['slug'] for result in results]
    print(slugs)
    newSlug = ''.join(random.choice(string.ascii_lowercase) for i in range(8))
    if newSlug in slugs:
        #Should basically never get here!
        while newSlug in slugs:
            newSlug = ''.join(random.choice(string.ascii_lowercase) for i in range(8))
    return newSlug
    
    
#+end_src

*** Verify Floor Names

- If floor\under{}name doesn't already exist return true (user is
  allowed to create the floor)
- If floor\under{}name exists, check password
  - if password is right, return true 
  - if password is wrong, return false
#+name: verify_floor_name
#+begin_src python :tangle app.py
def verify_floor_name(floor_name, password):
    getGroupIdQuery = '''
    SELECT * FROM Rooms
    WHERE floor_name = :floor_name;
    '''
    results,_ = query_db(getGroupIdQuery, {'floor_name':floor_name})
    if not results:
        return True
    password_hash = results[0]['password_hash']
    return check_password_hash(password_hash, password)
#+end_src


