linktower.html

<div id="outline-container-org8e8b42d" class="outline-4">
<h4 id="org8e8b42d"><span class="section-number-4">3.2.3.</span> close_connection</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
The database connection is after Flask finishes the request. At this
point changes to the database are
committed 
</p>

<div class="org-src-container">
<pre class="src src-python">@app.teardown_appcontext
def close_connection(exception):
    db = getattr(g, '_database', None)
    if db is not None:
        db.commit()
        db.close()
        
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf129b52" class="outline-3">
<h3 id="orgf129b52"><span class="section-number-3">3.3.</span> Methods that Query the Database</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-orge8f4dc4" class="outline-4">
<h4 id="orge8f4dc4"><span class="section-number-4">3.3.1.</span> Insert Room</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
The room is created first and the resulting room<sub>id</sub> is used when
creating the link entries
</p>

<div class="org-src-container">
<pre class="src src-python" id="org779333c">def insert_room_in_db(roomTitle, roomFloor_Name, roomPassword, labelToLinks, slug):
    password_hash =generate_password_hash(roomPassword)
    insertRoomQuery = '''
    INSERT INTO Rooms(title, floor_name, slug, password_hash)
    VALUES (:title, :floor_name, :slug, :password_hash);
    '''
    
    _, room_id = query_db(insertRoomQuery,
                     {"title":roomTitle, "floor_name":roomFloor_Name,
                      "slug":slug, "password_hash": password_hash})    

    insertLinkQuery = '''
    INSERT INTO Links (url, domainName, description, label, room_id)
    VALUES (:url, :domainName, :description, :label, :room_id);
    '''
    for label, links in labelToLinks.items():
        for link in links:
            domainName = urlparse(link['url']).netloc
            query_db(insertLinkQuery,
                     {'url':link['url'], 'domainName':domainName, 'description':link['description'],
                      'label':label,'room_id':room_id})
</pre>
</div>
</div>
</div>

<div id="outline-container-org210addd" class="outline-4">
<h4 id="org210addd"><span class="section-number-4">3.3.2.</span> Update Room</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
The record in the Rooms table is updated if there is a change in one
of the fields, otherwise it is unmodified.
</p>

<p>
Links whose label, description, or url are changed are deleted, and
the updated version is inserted. 
</p>
<div class="org-src-container">
<pre class="src src-python">def update_room_in_db(changedRoomInfo, addedLinks, removedLinks, roomId):

    updateTitleQuery = '''
    UPDATE Rooms
    SET title = :value
    WHERE id = :room_id
    '''
    updateFloorNameQuery = '''
    UPDATE Rooms
    SET floor_name  = :value
    WHERE id = :room_id
    '''
    updatePasswordQuery = '''
    UPDATE Rooms
    SET password_hash = :value
    WHERE id = :room_id
    '''
    if 'title' in changedRoomInfo:
        query_db(updateTitleQuery, {'value':changedRoomInfo['title'], 'room_id':roomId})
    if 'floor_name' in changedRoomInfo:
        query_db(updateFloorNameQuery, {'value':changedRoomInfo['floor_name'], 'room_id':roomId})
    if 'password' in changedRoomInfo:
        query_db(updatePasswordQuery,{'value':generate_password_hash(changedRoomInfo['password']),'room_id':roomId})
       

    deleteLinkQuery = '''
    DELETE FROM Links
    WHERE url = :url
    AND room_id = :room_id;
    
    '''
    for link in removedLinks:
        query_db(deleteLinkQuery, {'url':link['url'], 'room_id':roomId})

        
    insertLinkQuery = '''
    INSERT INTO Links (url, domainName, description, label, room_id)
    VALUES (:url, :domainName, :description, :label, :room_id);
    '''
    for link in addedLinks:
        #insert links
        domainName = urlparse(link['url']).netloc
        query_db(insertLinkQuery,
                     {'url':link['url'], 'domainName':domainName, 'description':link['description'],
                      'label':link['label'],'room_id':roomId})    
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd58ee1e" class="outline-4">
<h4 id="orgd58ee1e"><span class="section-number-4">3.3.3.</span> Delete Room</h4>
<div class="outline-text-4" id="text-3-3-3">
<div class="org-src-container">
<pre class="src src-python">def delete_room(room_id):
    deleteLinksQuery = '''
    DELETE FROM Links
    WHERE room_id = :room_id;
    '''
    query_db(deleteLinksQuery, {'room_id':room_id})

    deleteRoomQuery = '''
    DELETE FROM Rooms
    WHERE id = :room_id;
    '''
    query_db(deleteRoomQuery, {'room_id':room_id})


    
</pre>
</div>
</div>
</div>

<div id="outline-container-org19d8e5b" class="outline-4">
<h4 id="org19d8e5b"><span class="section-number-4">3.3.4.</span> Generating Room URL Slugs</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
A room slug is 8 random lowercase letters, which works out to
208,827,064,576 unique options. Although collision is practically
impossible at this scale, I'm going to check anyway.
</p>

<div class="org-src-container">
<pre class="src src-python">def create_room_slug():
    getSlugsQuery = '''
    SELECT slug FROM Rooms;
    '''
    results,_ = query_db(getSlugsQuery)
    slugs = [result['slug'] for result in results]
    print(slugs)
    newSlug = ''.join(random.choice(string.ascii_lowercase) for i in range(8))
    if newSlug in slugs:
        #Should basically never get here!
        while newSlug in slugs:
            newSlug = ''.join(random.choice(string.ascii_lowercase) for i in range(8))
    return newSlug
    
    
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf914589" class="outline-4">
<h4 id="orgf914589"><span class="section-number-4">3.3.5.</span> Verify Floor Names</h4>
<div class="outline-text-4" id="text-3-3-5">
<ul class="org-ul">
<li>If floor_name doesn't already exist return true (user is
allowed to create the floor)</li>
<li>If floor_name exists, check password
<ul class="org-ul">
<li>if password is right, return true</li>
<li>if password is wrong, return false</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-python" id="orgfdb0574">def verify_floor_name(floor_name, password):
    getGroupIdQuery = '''
    SELECT * FROM Rooms
    WHERE floor_name = :floor_name;
    '''
    results,_ = query_db(getGroupIdQuery, {'floor_name':floor_name})
    if not results:
        return True
    password_hash = results[0]['password_hash']
    return check_password_hash(password_hash, password)
</pre>
</div>
</div>
</div>
