linktower.org
*** Getters
Methods that fetch an entity or group of entites based on a given criterion


Since slugs are unique, query\under{}db will return a list of exactly
one room, which is returned.
#+begin_src python :tangle app.py
def get_room_by_slug(slug):
    getRoomQuery = '''
    SELECT * FROM Rooms
    WHERE slug = :slug;
    '''
    rooms,_ = query_db(getRoomQuery, {"slug":slug})
    if not rooms:
        return {}
    #assert len(rooms) == 1
    return rooms[0]

#+end_src


#+name: get_links_for_room
#+begin_src python :tangle app.py
def get_links_for_room(roomId):
    getLinksQuery = '''
    SELECT * FROM Links
    WHERE room_id = :roomId;
    '''
    links,_ = query_db(getLinksQuery, {"roomId":roomId})
    return links
#+end_src


#+begin_src python :tangle app.py
def get_rooms_by_floor_name(floor_name):
    getRoomsQuery = '''
    SELECT * FROM Rooms
    WHERE floor_name = :floor_name
    '''
    return query_db(getRoomsQuery, {'floor_name':floor_name})[0]
#+end_src


The following two methods return a random number of records from the
Rooms table, possibly restricted to those having links to a specified
domain. In order to apply this restriction, a subquery to the Links
table is used.

Returns a list of floor\under{}name strings
#+begin_src python :tangle app.py
def get_random_floors(num, domain):
    if domain:
        getFloorsQuery = '''
        SELECT DISTINCT floor_name FROM Rooms
        WHERE id IN
        (SELECT room_id FROM Links WHERE domainName = :domain)
        ORDER BY RANDOM()
        LIMIT :num
        '''
        floors,_ = query_db(getFloorsQuery, {'num':num, 'domain':domain})
        return [floor['floor_name'] for floor in floors]
    else:
        getFloorsQuery = '''
        SELECT DISTINCT floor_name FROM Rooms
        ORDER BY RANDOM()
        LIMIT :num
        '''
        floors,_ = query_db(getFloorsQuery, {'num':num})
        return [floor['floor_name'] for floor in floors]
    
#+end_src



#+begin_src python :tangle app.py
def get_random_rooms(num, domain):
    if domain:
        getRoomsQuery = '''
        SELECT * FROM Rooms
        WHERE id IN
        (SELECT room_id FROM Links WHERE domainName = :domain)
        ORDER BY RANDOM()
        LIMIT :num
        '''
        rooms,_ = query_db(getRoomsQuery, {'num':num, 'domain':domain})
        return rooms
    else:
        getRoomsQuery = '''
        SELECT * FROM Rooms
        ORDER BY RANDOM()
        LIMIT :num
        '''
        rooms,_ = query_db(getRoomsQuery, {'num':num})
        return rooms
#+end_src

Returns a list of room records
#+begin_src python :tangle app.py
def get_random_links(num, domain):
    if domain:
        getLinksQuery = '''
        SELECT * FROM Links
        WHERE domainName = :domain
        ORDER BY RANDOM()
        LIMIT :num;
        '''
        links,_ = query_db(getLinksQuery, {'domain':domain, 'num':num})
        return links
    else:
        getLinksQuery = '''
        SELECT * FROM Links
        ORDER BY RANDOM()
        LIMIT :num;
        '''
        links,_ = query_db(getLinksQuery, {'num':num})
        return links
        
    
#+end_src

Doors are basically just internal backlinks. If room A links to room
B, then room B will display that it has a door to room A. For local
execution, the localhost IP address is used for the urls
#+begin_src python :tangle app.py
def get_doors_for_room(slug):
    getLinksQuery = '''
    SELECT * FROM Links
    WHERE url = :url;
    '''
    url = 'http://127.0.0.1:5000/room/{}'.format(slug)
    links,_ = query_db(getLinksQuery, {'url':url})
    room_ids = [link['room_id'] for link in links]

    getRoomQuery = '''
    SELECT * FROM Rooms
    WHERE id = :id;
    '''
    doors = []
    for id in room_ids:
        rooms,_ = query_db(getRoomQuery, {'id':id})
        if not rooms:
            pass
        else:
            #assert len(rooms) == 1
            if rooms[0]['slug'] != slug:
                doors.append(rooms[0])
    return doors
        
    
#+end_src

* Routes

** Static Pages

*** Home
#+begin_src python :tangle app.py
@app.route('/', methods=['GET'])
def home():
    return render_template('index.html')
#+end_src

*** Help
#+begin_src python :tangle app.py
@app.route('/help', methods=['GET'])
def help():
    return render_template('help.html')
#+end_src


*** Source code

Returns this document, which is generated from the org file.
#+begin_src python :tangle app.py
@app.route('/source', methods=['GET'])
def source():
    return send_from_directory('','linktower.html')
#+end_src

** New Room Form (GET)

A blank form for entering the necessary information is served to the user.


#+begin_src python :tangle app.py
@app.route('/new', methods=['GET'])
def get_new_form():
    return render_template("new.html", title='', links='', floor_name='', password='', errors=[])
#+end_src

** New Room Form (POST)

Next we set up a route for a ~POST~ request to the ~/room/new~ url for
the user to submit the form. If there are any errors in the
submission, the forms are repopulated with the user's input and the
errors are displayed to the user.

#+begin_src python :noweb yes :tangle app.py

@app.route('/new', methods=['POST'])
def post_new_form():
    errors = check_form_validity(request)
    form = request.form
    roomSlug = create_room_slug()
    links, badLinks = parse_links_form(request.form['links'])
    labelToLinks = associate_label_to_links(links)
    if badLinks or  errors:
        return render_template("new.html", title=form['title'], links=form['links'],
                               floor_name=form['floor_name'], password=form['password'], errors=badLinks+errors)
    insert_room_in_db(form['title'], form['floor_name'], form['password'], labelToLinks, roomSlug)
    return redirect(url_for('view_room', slug=roomSlug)) 
#+end_src

** View Room
Gets all links for a given room.

#+begin_src python :tangle app.py

@app.route('/room/<slug>', methods=['GET'])
def view_room(slug):
    room = get_room_by_slug(slug)
    if not room:
        return render_template("not_found.html", msg='room at {}'.format(slug))
    links = get_links_for_room(room['id'])
    labelToLinks = associate_label_to_links(links)
    doors = get_doors_for_room(slug)
    return render_template("room.html", room=room, labelToLinks=labelToLinks, doors=doors)
#+end_src




