linktower.html


<div id="outline-container-org2001b26" class="outline-4">
<h4 id="org2001b26"><span class="section-number-4">3.3.6.</span> Getters</h4>
<div class="outline-text-4" id="text-3-3-6">
<p>
Methods that fetch an entity or group of entites based on a given criterion
</p>


<p>
Since slugs are unique, query_db will return a list of exactly
one room, which is returned.
</p>
<div class="org-src-container">
<pre class="src src-python">def get_room_by_slug(slug):
    getRoomQuery = '''
    SELECT * FROM Rooms
    WHERE slug = :slug;
    '''
    rooms,_ = query_db(getRoomQuery, {"slug":slug})
    if not rooms:
        return {}
    #assert len(rooms) == 1
    return rooms[0]

</pre>
</div>


<div class="org-src-container">
<pre class="src src-python" id="orga9d7728">def get_links_for_room(roomId):
    getLinksQuery = '''
    SELECT * FROM Links
    WHERE room_id = :roomId;
    '''
    links,_ = query_db(getLinksQuery, {"roomId":roomId})
    return links
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python">def get_rooms_by_floor_name(floor_name):
    getRoomsQuery = '''
    SELECT * FROM Rooms
    WHERE floor_name = :floor_name
    '''
    return query_db(getRoomsQuery, {'floor_name':floor_name})[0]
</pre>
</div>


<p>
The following two methods return a random number of records from the
Rooms table, possibly restricted to those having links to a specified
domain. In order to apply this restriction, a subquery to the Links
table is used.
</p>

<p>
Returns a list of floor_name strings
</p>
<div class="org-src-container">
<pre class="src src-python">def get_random_floors(num, domain):
    if domain:
        getFloorsQuery = '''
        SELECT DISTINCT floor_name FROM Rooms
        WHERE id IN
        (SELECT room_id FROM Links WHERE domainName = :domain)
        ORDER BY RANDOM()
        LIMIT :num
        '''
        floors,_ = query_db(getFloorsQuery, {'num':num, 'domain':domain})
        return [floor['floor_name'] for floor in floors]
    else:
        getFloorsQuery = '''
        SELECT DISTINCT floor_name FROM Rooms
        ORDER BY RANDOM()
        LIMIT :num
        '''
        floors,_ = query_db(getFloorsQuery, {'num':num})
        return [floor['floor_name'] for floor in floors]
    
</pre>
</div>



<div class="org-src-container">
<pre class="src src-python">def get_random_rooms(num, domain):
    if domain:
        getRoomsQuery = '''
        SELECT * FROM Rooms
        WHERE id IN
        (SELECT room_id FROM Links WHERE domainName = :domain)
        ORDER BY RANDOM()
        LIMIT :num
        '''
        rooms,_ = query_db(getRoomsQuery, {'num':num, 'domain':domain})
        return rooms
    else:
        getRoomsQuery = '''
        SELECT * FROM Rooms
        ORDER BY RANDOM()
        LIMIT :num
        '''
        rooms,_ = query_db(getRoomsQuery, {'num':num})
        return rooms
</pre>
</div>

<p>
Returns a list of room records
</p>
<div class="org-src-container">
<pre class="src src-python">def get_random_links(num, domain):
    if domain:
        getLinksQuery = '''
        SELECT * FROM Links
        WHERE domainName = :domain
        ORDER BY RANDOM()
        LIMIT :num;
        '''
        links,_ = query_db(getLinksQuery, {'domain':domain, 'num':num})
        return links
    else:
        getLinksQuery = '''
        SELECT * FROM Links
        ORDER BY RANDOM()
        LIMIT :num;
        '''
        links,_ = query_db(getLinksQuery, {'num':num})
        return links
        
    
</pre>
</div>

<p>
Doors are basically just internal backlinks. If room A links to room
B, then room B will display that it has a door to room A. For local
execution, the localhost IP address is used for the urls
</p>
<div class="org-src-container">
<pre class="src src-python">def get_doors_for_room(slug):
    getLinksQuery = '''
    SELECT * FROM Links
    WHERE url = :url;
    '''
    url = 'http://127.0.0.1:5000/room/{}'.format(slug)
    links,_ = query_db(getLinksQuery, {'url':url})
    room_ids = [link['room_id'] for link in links]

    getRoomQuery = '''
    SELECT * FROM Rooms
    WHERE id = :id;
    '''
    doors = []
    for id in room_ids:
        rooms,_ = query_db(getRoomQuery, {'id':id})
        if not rooms:
            pass
        else:
            #assert len(rooms) == 1
            if rooms[0]['slug'] != slug:
                doors.append(rooms[0])
    return doors
        
    
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org97c44fb" class="outline-2">
<h2 id="org97c44fb"><span class="section-number-2">4.</span> Routes</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgafcacdb" class="outline-3">
<h3 id="orgafcacdb"><span class="section-number-3">4.1.</span> Static Pages</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org8cebd44" class="outline-4">
<h4 id="org8cebd44"><span class="section-number-4">4.1.1.</span> Home</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-python">@app.route('/', methods=['GET'])
def home():
    return render_template('index.html')
</pre>
</div>
</div>
</div>

<div id="outline-container-org039bc27" class="outline-4">
<h4 id="org039bc27"><span class="section-number-4">4.1.2.</span> Help</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">
<pre class="src src-python">@app.route('/help', methods=['GET'])
def help():
    return render_template('help.html')
</pre>
</div>
</div>
</div>


<div id="outline-container-orga61e347" class="outline-4">
<h4 id="orga61e347"><span class="section-number-4">4.1.3.</span> Source code</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Returns this document, which is generated from the org file.
</p>
<div class="org-src-container">
<pre class="src src-python">@app.route('/source', methods=['GET'])
def source():
    return send_from_directory('','linktower.html')
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9698535" class="outline-3">
<h3 id="org9698535"><span class="section-number-3">4.2.</span> New Room Form (GET)</h3>
<div class="outline-text-3" id="text-4-2">
<p>
A blank form for entering the necessary information is served to the user.
</p>


<div class="org-src-container">
<pre class="src src-python">@app.route('/new', methods=['GET'])
def get_new_form():
    return render_template("new.html", title='', links='', floor_name='', password='', errors=[])
</pre>
</div>
</div>
</div>

<div id="outline-container-org364a02b" class="outline-3">
<h3 id="org364a02b"><span class="section-number-3">4.3.</span> New Room Form (POST)</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Next we set up a route for a <code>POST</code> request to the <code>/room/new</code> url for
the user to submit the form. If there are any errors in the
submission, the forms are repopulated with the user's input and the
errors are displayed to the user.
</p>

<div class="org-src-container">
<pre class="src src-python">
@app.route('/new', methods=['POST'])
def post_new_form():
    errors = check_form_validity(request)
    form = request.form
    roomSlug = create_room_slug()
    links, badLinks = parse_links_form(request.form['links'])
    labelToLinks = associate_label_to_links(links)
    if badLinks or  errors:
        return render_template("new.html", title=form['title'], links=form['links'],
                               floor_name=form['floor_name'], password=form['password'], errors=badLinks+errors)
    insert_room_in_db(form['title'], form['floor_name'], form['password'], labelToLinks, roomSlug)
    return redirect(url_for('view_room', slug=roomSlug)) 
</pre>
</div>
</div>
</div>

<div id="outline-container-org48ff057" class="outline-3">
<h3 id="org48ff057"><span class="section-number-3">4.4.</span> View Room</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Gets all links for a given room.
</p>

<div class="org-src-container">
<pre class="src src-python">
@app.route('/room/&lt;slug&gt;', methods=['GET'])
def view_room(slug):
    room = get_room_by_slug(slug)
    if not room:
        return render_template("not_found.html", msg='room at {}'.format(slug))
    links = get_links_for_room(room['id'])
    labelToLinks = associate_label_to_links(links)
    doors = get_doors_for_room(slug)
    return render_template("room.html", room=room, labelToLinks=labelToLinks, doors=doors)
</pre>
</div>
</div>
</div>
