linktower.org
** Edit Room Form (GET)

The edit form is be popluated with the current contents of the
room. If the room does not exist, an error page is returned. The links
from the database are converted back to markdown form [description](url)

#+begin_src python :tangle app.py
@app.route('/room/<slug>/edit', methods=['GET'])
def get_edit_form(slug):
    room = get_room_by_slug(slug)
    if not room:
        return render_template("not_found.html", msg='room at {}'.format(slug))
    links = get_links_for_room(room['id'])
    labelToLinks = associate_label_to_links(links)
    linksform = []
    for label, linkslist in labelToLinks.items():
        linksform.append(label)
        for link in linkslist:
            linksform.append("[{}]({})".format(link['description'], link['url']))
        linksform.append('\n')
    return render_template("edit.html", title=room['title'], links='\n'.join(linksform),
                               floor_name=room['floor_name'], password='', errors=[])

    
    
#+end_src

** Edit Room Form (POST)
Posting the edit form requires many of the same steps as posting the
new form, but after parsing the form contents must be diffed with the
existing contents of the room, and the room (and associated links)
selectively updated.

*** Diffing Links
New links are parsed from the form, while the old links are fetched
from the database. Each are converted into a set of tuples of ~(url,
label, description)~ (dicts cannot be in a set), and the sets are
subtracted from each other to find the sets of added links and removed
links. Links are also considered "removed" if any field is
changed. The updated versions will be in the new set. These are then
converted from tuples to dicts to be inserted/deleted in the database.


#+begin_src python :tangle app.py
@app.route('/room/<slug>/edit', methods=['POST'])
def post_edit_form(slug):

    #get room data
    room = get_room_by_slug(slug)
    if not room:
        return render_template("not_found.html", msg='room at {}'.format(slug))

    #get form data
    errors = check_form_validity(request)
    form = request.form
    links, badLinks = parse_links_form(request.form['links'])
    if badLinks or errors:
        return render_template("edit.html", title=form['title'], links=form['links'],
                               floor_name=form['floor_name'], password=form['password'], errors=badLinks+errors)
    
    #normalize links to common format (list of dicts)
    newLinks = set([(link['url'], link['label'], link['description'])
                    for link in links])
    oldLinks = set([(link['url'], link['label'], link['description'])
                    for link in get_links_for_room(room['id'])])
    #diff links
    addedLinks = [{'url':link[0], 'label':link[1], 'description':link[2]} for link in list(newLinks - oldLinks)]
    removedLinks = [{'url':link[0], 'label':link[1], 'description':link[2]} for link in list(oldLinks - newLinks)]
    
    
    changedRoomInfo = {}
    if form['title'] != room['title']:
        changedRoomInfo['title'] = form['title']
    if form['floor_name'] != room['floor_name']:
        changedRoomInfo['floor'] = form['floor']
    if form['new_password']:
        changedRoomInfo['password'] = form['new_password']
        

    
    update_room_in_db(changedRoomInfo, addedLinks, removedLinks, room['id'])
    return redirect(url_for('view_room', slug=slug)) 

#+end_src

** Delete Room (GET)



#+begin_src python :tangle app.py
@app.route('/room/<slug>/delete', methods=['GET'])
def get_delete_room_form(slug):
    room = get_room_by_slug(slug)
    if not room:
        return render_template("not_found.html", msg='room at {}'.format(slug))
    return render_template("delete.html", room=room, errors=[], success=False)
#+end_src


** Delete Room (POST)


#+begin_src python :tangle app.py
@app.route('/room/<slug>/delete', methods=['POST'])
def post_delete_room_form(slug):
    room = get_room_by_slug(slug)
    password = request.form['password']
    if not room:
        return render_template("not_found.html", msg='room at {}'.format(slug))
    if not check_password_hash(room['password_hash'], password):
        return render_template("delete.html", room=room, errors=['Incorrect password'], success=False)
    delete_room(room['id'])
    return render_template("delete.html", room=room, errors=[], success=True)
#+end_src




** Show All Rooms on Floor

Gets a list of all rooms on a floor, returns an error page if the floor
is not found.
#+begin_src python :tangle app.py
@app.route('/floor/<floor_name>', methods=['GET'])
def list_rooms_on_floor(floor_name):
    rooms = get_rooms_by_floor_name(floor_name)
    if not rooms:
       return  render_template("not_found.html", msg='floor with name {}'.format(floor_name))
    return render_template("floor_name.html", floor_name=floor_name, rooms=rooms)
#+end_src

** Discover (GET)
Returns a random selection of 10 floors, rooms, and links.

#+begin_src python :tangle app.py
@app.route('/discover', methods=['GET'])
def discover_get():
    floors = get_random_floors(10, '')
    rooms = get_random_rooms(10, '')
    links = get_random_links(10, '')    
    return render_template('discover.html', num=10, floors=floors, rooms=rooms, links=links)
#+end_src

** Discover (POST)

Returns a random selection of at most 10 floors, rooms and links
containing the given domain, or 10 random floors, rooms and links if
no domain is given.

#+begin_src python :tangle app.py
@app.route('/discover', methods=['POST'])
def discover_post():
    form = request.form
    floors = get_random_floors(10, form['domain'])
    rooms = get_random_rooms(10, form['domain'])
    links = get_random_links(10, form['domain'])
    return render_template('discover.html', num=10, floors=floors, rooms=rooms, links=links)
#+end_src

* Helper Methods

