linktower.html




<div id="outline-container-orgea7aaef" class="outline-3">
<h3 id="orgea7aaef"><span class="section-number-3">4.5.</span> Edit Room Form (GET)</h3>
<div class="outline-text-3" id="text-4-5">
<p>
The edit form is be popluated with the current contents of the
room. If the room does not exist, an error page is returned. The links
from the database are converted back to markdown form [description](url)
</p>

<div class="org-src-container">
<pre class="src src-python">@app.route('/room/&lt;slug&gt;/edit', methods=['GET'])
def get_edit_form(slug):
    room = get_room_by_slug(slug)
    if not room:
        return render_template("not_found.html", msg='room at {}'.format(slug))
    links = get_links_for_room(room['id'])
    labelToLinks = associate_label_to_links(links)
    linksform = []
    for label, linkslist in labelToLinks.items():
        linksform.append(label)
        for link in linkslist:
            linksform.append("[{}]({})".format(link['description'], link['url']))
        linksform.append('\n')
    return render_template("edit.html", title=room['title'], links='\n'.join(linksform),
                               floor_name=room['floor_name'], password='', errors=[])

    
    
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc20d917" class="outline-3">
<h3 id="orgc20d917"><span class="section-number-3">4.6.</span> Edit Room Form (POST)</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Posting the edit form requires many of the same steps as posting the
new form, but after parsing the form contents must be diffed with the
existing contents of the room, and the room (and associated links)
selectively updated.
</p>
</div>

<div id="outline-container-org0714450" class="outline-4">
<h4 id="org0714450"><span class="section-number-4">4.6.1.</span> Diffing Links</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
New links are parsed from the form, while the old links are fetched
from the database. Each are converted into a set of tuples of <code>(url,
label, description)</code> (dicts cannot be in a set), and the sets are
subtracted from each other to find the sets of added links and removed
links. Links are also considered "removed" if any field is
changed. The updated versions will be in the new set. These are then
converted from tuples to dicts to be inserted/deleted in the database.
</p>


<div class="org-src-container">
<pre class="src src-python">@app.route('/room/&lt;slug&gt;/edit', methods=['POST'])
def post_edit_form(slug):

    #get room data
    room = get_room_by_slug(slug)
    if not room:
        return render_template("not_found.html", msg='room at {}'.format(slug))

    #get form data
    errors = check_form_validity(request)
    form = request.form
    links, badLinks = parse_links_form(request.form['links'])
    if badLinks or errors:
        return render_template("edit.html", title=form['title'], links=form['links'],
                               floor_name=form['floor_name'], password=form['password'], errors=badLinks+errors)
    
    #normalize links to common format (list of dicts)
    newLinks = set([(link['url'], link['label'], link['description'])
                    for link in links])
    oldLinks = set([(link['url'], link['label'], link['description'])
                    for link in get_links_for_room(room['id'])])
    #diff links
    addedLinks = [{'url':link[0], 'label':link[1], 'description':link[2]} for link in list(newLinks - oldLinks)]
    removedLinks = [{'url':link[0], 'label':link[1], 'description':link[2]} for link in list(oldLinks - newLinks)]
    
    
    changedRoomInfo = {}
    if form['title'] != room['title']:
        changedRoomInfo['title'] = form['title']
    if form['floor_name'] != room['floor_name']:
        changedRoomInfo['floor'] = form['floor']
    if form['new_password']:
        changedRoomInfo['password'] = form['new_password']
        

    
    update_room_in_db(changedRoomInfo, addedLinks, removedLinks, room['id'])
    return redirect(url_for('view_room', slug=slug)) 

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd5e160d" class="outline-3">
<h3 id="orgd5e160d"><span class="section-number-3">4.7.</span> Delete Room (GET)</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">
<pre class="src src-python">@app.route('/room/&lt;slug&gt;/delete', methods=['GET'])
def get_delete_room_form(slug):
    room = get_room_by_slug(slug)
    if not room:
        return render_template("not_found.html", msg='room at {}'.format(slug))
    return render_template("delete.html", room=room, errors=[], success=False)
</pre>
</div>
</div>
</div>


<div id="outline-container-org086ef9f" class="outline-3">
<h3 id="org086ef9f"><span class="section-number-3">4.8.</span> Delete Room (POST)</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">
<pre class="src src-python">@app.route('/room/&lt;slug&gt;/delete', methods=['POST'])
def post_delete_room_form(slug):
    room = get_room_by_slug(slug)
    password = request.form['password']
    if not room:
        return render_template("not_found.html", msg='room at {}'.format(slug))
    if not check_password_hash(room['password_hash'], password):
        return render_template("delete.html", room=room, errors=['Incorrect password'], success=False)
    delete_room(room['id'])
    return render_template("delete.html", room=room, errors=[], success=True)
</pre>
</div>
</div>
</div>




<div id="outline-container-org5c1eb3c" class="outline-3">
<h3 id="org5c1eb3c"><span class="section-number-3">4.9.</span> Show All Rooms on Floor</h3>
<div class="outline-text-3" id="text-4-9">
<p>
Gets a list of all rooms on a floor, returns an error page if the floor
is not found.
</p>
<div class="org-src-container">
<pre class="src src-python">@app.route('/floor/&lt;floor_name&gt;', methods=['GET'])
def list_rooms_on_floor(floor_name):
    rooms = get_rooms_by_floor_name(floor_name)
    if not rooms:
       return  render_template("not_found.html", msg='floor with name {}'.format(floor_name))
    return render_template("floor_name.html", floor_name=floor_name, rooms=rooms)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a5bbe2" class="outline-3">
<h3 id="org8a5bbe2"><span class="section-number-3">4.10.</span> Discover (GET)</h3>
<div class="outline-text-3" id="text-4-10">
<p>
Returns a random selection of 10 floors, rooms, and links.
</p>

<div class="org-src-container">
<pre class="src src-python">@app.route('/discover', methods=['GET'])
def discover_get():
    floors = get_random_floors(10, '')
    rooms = get_random_rooms(10, '')
    links = get_random_links(10, '')    
    return render_template('discover.html', num=10, floors=floors, rooms=rooms, links=links)
</pre>
</div>
</div>
</div>

<div id="outline-container-org90b541e" class="outline-3">
<h3 id="org90b541e"><span class="section-number-3">4.11.</span> Discover (POST)</h3>
<div class="outline-text-3" id="text-4-11">
<p>
Returns a random selection of at most 10 floors, rooms and links
containing the given domain, or 10 random floors, rooms and links if
no domain is given.
</p>

<div class="org-src-container">
<pre class="src src-python">@app.route('/discover', methods=['POST'])
def discover_post():
    form = request.form
    floors = get_random_floors(10, form['domain'])
    rooms = get_random_rooms(10, form['domain'])
    links = get_random_links(10, form['domain'])
    return render_template('discover.html', num=10, floors=floors, rooms=rooms, links=links)
</pre>
</div>
</div>
</div>
</div>
