linktower.org
** Parsing the Links Form

The links form is expected to contain links in markdown format
[description](url) and labels that are lines ending in a colon. At least one link is mandatory, labels are
optional. Each link and label must be on its own line. As a
result, the link form will consist of markdown links potentially
interspersed with labels. Thus, the links form can have the following structure:

#+begin_example
[unlabeled link](url)
Label1:
[link for label1](url)
[2nd link for label1](url)
Labels can have spaces:
[link for Labels can have spaces](url)
Labels with no links are ignored:
#+end_example

The following method parses the link form into a list of dicts with
the structure ~{'description':, 'url':, 'label':}~, which mirrors the
link representation in the database

Malformed labels and links, as well as any other rejected input, is
returned in a list
#+NAME: parse_links_form
#+begin_src python :tangle app.py 
def parse_links_form(form):
    links = []
    currentLabel = ''
    badInput = []
    existingUrls = set()
    for line in form.splitlines():
        if line.endswith(':'):
            currentLabel = line
        elif len(set(line) - set(string.whitespace)) == 0:
            pass
        #parse the markdown link for its components 
        elif line.startswith('[') and '](' in line and line.endswith(')'):
            description = line[1:line.index('](')]
            url = line[line.index('](')+2:-1]
            parsedUrl = urlparse(url)
            
            #check if url is valid
            if not all([parsedUrl.scheme, parsedUrl.netloc, parsedUrl.path]):
                badInput.append(line + " Could not parse link. Try copying the link from your browser's search bar")
            elif url in existingUrls:
                badInput.append(line + " Duplicate urls are not accepted. Delete this line and resubmit the form")
            else:
                links.append({'description':description, 'url':url, 'label':currentLabel})
                existingUrls.add(url)
            
        else:
            badInput.append(line + " This line is not recognized as a link or label")

    return (links, badInput)        
#+end_src

** Associated Each Label to its Links

Returns a *sorted* map of each label to a list of links. Unlabeled
links are associated to the empty string. Sorting is done so that the
unlabeled links appear first on the room page.
#+begin_src python :tangle app.py
def associate_label_to_links(links):
    labelToLinks = {}
    for link in links:
        label = link['label']
        labelToLinks.setdefault(label, []).append(link)
    return {i[0]:i[1] for i in sorted(labelToLinks.items())} 
#+end_src

** Check Form Validity

This helper is used whenthe edit and new form are posted. It returns
a list of errors found, or an empty list if no errors are found. This
is where password validation is done for a room.
#+name: check_form_validity
#+begin_src python :tangle app.py
def check_form_validity(requests):
    roomTitle = request.form['title']
    roomFloor_Name = request.form['floor_name']
    roomPassword = request.form['password']
    roomLinks = request.form['links']
    
    #check for empty fields
    
    errors = []
    
    if not roomTitle:
        errors.append('Title field is empty')
    if not roomFloor_Name:
        errors.append('Floor Name field is empty')
    if not roomPassword:
        errors.append('Password field is empty')
    if not roomLinks:
        errors.append('Title field is empty')
        
    illegalChars = set(roomFloor_Name) - set(string.ascii_letters + string.digits)
    if illegalChars:
        errors.append('Floor name must be ascii letters and numbers only, {} not allowed'.format(illegalChars))
    if not verify_floor_name(roomFloor_Name, roomPassword):
        errors.append('Incorrect password for floor {}'.format(roomFloor_Name))
    return errors
#+end_src



* Views

The Jinja template system is used to generate HTML. Parameters are
passed to templates through the ~render_template~ method, and can then
be used as normal python code within the template.

** Base Template
The HTML from templates that inherit from base.html is inserted
between the tags ~{% block content %}{% endblock %}~

#+begin_src html :tangle templates/base.html
<!DOCTYPE html>
<html lang="en">
<head>
{% block head %}
    <!-- <link rel="stylesheet" href="static/style.css" />
<style>
td {
  text-align: left;
  vertical-align: middle;
}
th {
  text-align: left;
  vertical-align: middle;
}
<body style="padding-left: 5%; padding-right: 5%;">
</style>
 -->
<a href="/new">new</a> <a href="/discover">discover</a> <a href="/help">help</a> <a href="/">home</a><br>
<title>{% block title %}{% endblock %} - LinkRoom</title>
{% endblock %}
</head>
<body >
  <div id="content">{% block content %}{% endblock %}</div>
  <div id="footer">
    {% block footer %}{% endblock %}
  </div>  
</body>
</html>
#+end_src

** Form Template

The ~form.html~ template is the basis for the ~new~ and ~edit~ pages,
which are nearly identical . The blocks to be filled in are ~title~, ~header~ and ~fields~.

_Parameters_
- *title* the raw text from the title input box
- *links* the raw text from the links input box

#+begin_src html :tangle templates/form.html
{% extends "base.html" %}
{% block title %}{% endblock %}
{% block content %}
<h1> {% block header %}{% endblock %} </h1>
<ul>
 <li>labels must end in a colon:</li>
 <li>[links are in markdown format](<a href="https://www.markdownguide.org/basic-syntax#links">https://www.markdownguide.org/basic-syntax#links</a>)</li>
 <li>one label <strong>or</strong> link per line</li>
 <li>order is not preserved: labels will be displayed in alphabetical order</li>
</ul>

Title:<br>
<textarea name="title" rows="1" cols="80" form="linkform">{{ title }}</textarea> 
<br><br>
Links:<br>
<textarea name="links" rows="32" cols="80" form="linkform">{{ links }}</textarea>
<br>

<form method="POST" id="linkform">
  <br>
  {% block fields %}{% endblock %}
  <input type="submit" value="Save Room">
</form>
{% if errors %}
    <h2>Errors:</h2>
    <blockquote>
      {% for error in errors %}
         <li> {{ error }} </li><br>
      {% endfor %}
    </blockquote>
{% endif %}
{% endblock %}
#+end_src

