linktower.html

<div id="outline-container-orgf71fd86" class="outline-2">
<h2 id="orgf71fd86"><span class="section-number-2">5.</span> Helper Methods</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org7db789f" class="outline-3">
<h3 id="org7db789f"><span class="section-number-3">5.1.</span> Parsing the Links Form</h3>
<div class="outline-text-3" id="text-5-1">
<p>
The links form is expected to contain links in markdown format
[description](url) and labels that are lines ending in a colon. At least one link is mandatory, labels are
optional. Each link and label must be on its own line. As a
result, the link form will consist of markdown links potentially
interspersed with labels. Thus, the links form can have the following structure:
</p>

<pre class="example" id="org53c94d4">
[unlabeled link](url)
Label1:
[link for label1](url)
[2nd link for label1](url)
Labels can have spaces:
[link for Labels can have spaces](url)
Labels with no links are ignored:
</pre>

<p>
The following method parses the link form into a list of dicts with
the structure <code>{'description':, 'url':, 'label':}</code>, which mirrors the
link representation in the database
</p>

<p>
Malformed labels and links, as well as any other rejected input, is
returned in a list
</p>
<div class="org-src-container">
<pre class="src src-python" id="org0dbabe6">def parse_links_form(form):
    links = []
    currentLabel = ''
    badInput = []
    existingUrls = set()
    for line in form.splitlines():
        if line.endswith(':'):
            currentLabel = line
        elif len(set(line) - set(string.whitespace)) == 0:
            pass
        #parse the markdown link for its components 
        elif line.startswith('[') and '](' in line and line.endswith(')'):
            description = line[1:line.index('](')]
            url = line[line.index('](')+2:-1]
            parsedUrl = urlparse(url)
            
            #check if url is valid
            if not all([parsedUrl.scheme, parsedUrl.netloc, parsedUrl.path]):
                badInput.append(line + " Could not parse link. Try copying the link from your browser's search bar")
            elif url in existingUrls:
                badInput.append(line + " Duplicate urls are not accepted. Delete this line and resubmit the form")
            else:
                links.append({'description':description, 'url':url, 'label':currentLabel})
                existingUrls.add(url)
            
        else:
            badInput.append(line + " This line is not recognized as a link or label")

    return (links, badInput)        
</pre>
</div>
</div>
</div>

<div id="outline-container-org75ff060" class="outline-3">
<h3 id="org75ff060"><span class="section-number-3">5.2.</span> Associated Each Label to its Links</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Returns a <b>sorted</b> map of each label to a list of links. Unlabeled
links are associated to the empty string. Sorting is done so that the
unlabeled links appear first on the room page.
</p>
<div class="org-src-container">
<pre class="src src-python">def associate_label_to_links(links):
    labelToLinks = {}
    for link in links:
        label = link['label']
        labelToLinks.setdefault(label, []).append(link)
    return {i[0]:i[1] for i in sorted(labelToLinks.items())} 
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ef15a8" class="outline-3">
<h3 id="org5ef15a8"><span class="section-number-3">5.3.</span> Check Form Validity</h3>
<div class="outline-text-3" id="text-5-3">
<p>
This helper is used whenthe edit and new form are posted. It returns
a list of errors found, or an empty list if no errors are found. This
is where password validation is done for a room.
</p>
<div class="org-src-container">
<pre class="src src-python" id="org5a8faf4">def check_form_validity(requests):
    roomTitle = request.form['title']
    roomFloor_Name = request.form['floor_name']
    roomPassword = request.form['password']
    roomLinks = request.form['links']
    
    #check for empty fields
    
    errors = []
    
    if not roomTitle:
        errors.append('Title field is empty')
    if not roomFloor_Name:
        errors.append('Floor Name field is empty')
    if not roomPassword:
        errors.append('Password field is empty')
    if not roomLinks:
        errors.append('Title field is empty')
        
    illegalChars = set(roomFloor_Name) - set(string.ascii_letters + string.digits)
    if illegalChars:
        errors.append('Floor name must be ascii letters and numbers only, {} not allowed'.format(illegalChars))
    if not verify_floor_name(roomFloor_Name, roomPassword):
        errors.append('Incorrect password for floor {}'.format(roomFloor_Name))
    return errors
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-orgbcd0757" class="outline-2">
<h2 id="orgbcd0757"><span class="section-number-2">6.</span> Views</h2>
<div class="outline-text-2" id="text-6">
<p>
The Jinja template system is used to generate HTML. Parameters are
passed to templates through the <code>render_template</code> method, and can then
be used as normal python code within the template.
</p>
</div>

<div id="outline-container-org0aff726" class="outline-3">
<h3 id="org0aff726"><span class="section-number-3">6.1.</span> Base Template</h3>
<div class="outline-text-3" id="text-6-1">
<p>
The HTML from templates that inherit from base.html is inserted
between the tags <code>{% block content %}{% endblock %}</code>
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;!DOCTYPE html&gt;
&lt;html lang="en"&gt;
&lt;head&gt;
{% block head %}
    &lt;!-- &lt;link rel="stylesheet" href="static/style.css" /&gt;
&lt;style&gt;
td {
  text-align: left;
  vertical-align: middle;
}
th {
  text-align: left;
  vertical-align: middle;
}
&lt;body style="padding-left: 5%; padding-right: 5%;"&gt;
&lt;/style&gt;
 --&gt;
&lt;a href="/new"&gt;new&lt;/a&gt; &lt;a href="/discover"&gt;discover&lt;/a&gt; &lt;a href="/help"&gt;help&lt;/a&gt; &lt;a href="/"&gt;home&lt;/a&gt;&lt;br&gt;
&lt;title&gt;{% block title %}{% endblock %} - LinkRoom&lt;/title&gt;
{% endblock %}
&lt;/head&gt;
&lt;body &gt;
  &lt;div id="content"&gt;{% block content %}{% endblock %}&lt;/div&gt;
  &lt;div id="footer"&gt;
    {% block footer %}{% endblock %}
  &lt;/div&gt;  
&lt;/body&gt;
&lt;/html&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4a6dca" class="outline-3">
<h3 id="orgd4a6dca"><span class="section-number-3">6.2.</span> Form Template</h3>
<div class="outline-text-3" id="text-6-2">
<p>
The <code>form.html</code> template is the basis for the <code>new</code> and <code>edit</code> pages,
which are nearly identical . The blocks to be filled in are <code>title</code>, <code>header</code> and <code>fields</code>.
</p>

<p>
<span class="underline">Parameters</span>
</p>
<ul class="org-ul">
<li><b>title</b> the raw text from the title input box</li>
<li><b>links</b> the raw text from the links input box</li>
</ul>

<div class="org-src-container">
<pre class="src src-html">{% extends "base.html" %}
{% block title %}{% endblock %}
{% block content %}
&lt;h1&gt; {% block header %}{% endblock %} &lt;/h1&gt;
&lt;ul&gt;
 &lt;li&gt;labels must end in a colon:&lt;/li&gt;
 &lt;li&gt;[links are in markdown format](&lt;a href="https://www.markdownguide.org/basic-syntax#links"&gt;https://www.markdownguide.org/basic-syntax#links&lt;/a&gt;)&lt;/li&gt;
 &lt;li&gt;one label &lt;strong&gt;or&lt;/strong&gt; link per line&lt;/li&gt;
 &lt;li&gt;order is not preserved: labels will be displayed in alphabetical order&lt;/li&gt;
&lt;/ul&gt;

Title:&lt;br&gt;
&lt;textarea name="title" rows="1" cols="80" form="linkform"&gt;{{ title }}&lt;/textarea&gt; 
&lt;br&gt;&lt;br&gt;
Links:&lt;br&gt;
&lt;textarea name="links" rows="32" cols="80" form="linkform"&gt;{{ links }}&lt;/textarea&gt;
&lt;br&gt;

&lt;form method="POST" id="linkform"&gt;
  &lt;br&gt;
  {% block fields %}{% endblock %}
  &lt;input type="submit" value="Save Room"&gt;
&lt;/form&gt;
{% if errors %}
    &lt;h2&gt;Errors:&lt;/h2&gt;
    &lt;blockquote&gt;
      {% for error in errors %}
         &lt;li&gt; {{ error }} &lt;/li&gt;&lt;br&gt;
      {% endfor %}
    &lt;/blockquote&gt;
{% endif %}
{% endblock %}
</pre>
</div>
</div>
