linktower.org
*** New Form

_Parameters_
- *floor\under{}name* the raw text from the floor\under{}name input box
- *password* the raw text from the password input box

#+begin_src html :tangle templates/new.html
{% extends "form.html" %}
{% block title %} new room {% endblock %}
{% block header %} new room {% endblock %}
{% block fields %}
<dl>
  <dt> floor name: </dt>
  <dd><input type="text" name="floor_name" value="{{ floor_name }}"></dd>
  <dt>password (do <strong>not</strong> lose, can't be recovered):</dt>
  <dd><input type="text" name="password" value="{{ password }}"></dd>
</dl>
 
  
  
  
{% endblock %}
#+end_src

*** Edit Form

_Parameters_
- *floor\under{}name* the raw text from the floor\under{}name input box
- *password* the raw text from the password input box
- *new\under{}password* the raw text from the new\under{}password input box

#+begin_src html :tangle templates/edit.html
{% extends "form.html" %}
{% block title %} edit room {% endblock %}
{% block header %} edit room {% endblock %}
{% block fields %}
  <dl>
    <dt>floor name: </dt>
    <dd><input type="text" name="floor_name" value="{{ floor_name }}"></dd>
    <dt>password:</dt>
    <dd><input type="text" name="password" value="{{ password }}"></dd>
    <dt>set new password (optional):</dt>
    <dd><input type="text" name="new_password" value=""></dd>
  </dl>

   

{% endblock %}
#+end_src



** Room Template

Unlabeled links are rendered on the same indentation as labels, while
labeled links are indented relative to the labels. Recall that
unlabeled links are associated to the empty string in the
~labelToLinks~ dict.

_Parameters_
- *room* a dict corresponding to the room schema see
- *labelToLinks* a dict of label => list(link) see
- *doors* list of room dicts


#+begin_src html :tangle templates/room.html
{% extends "base.html" %}
{% block title %}{{ room['title'] }}{% endblock %}
{% block content %}
<h1> {{ room['title'] }} </h1> 
on floor <a href="/floor/{{ room['floor_name'] }}">{{ room['floor_name'] }}</a>
<p><a href="/room/{{ room['slug'] }}/edit">edit</a>
<a href="/room/{{ room['slug'] }}/delete">delete</a></p>
<br>
{% for label, links in labelToLinks.items() %}
    {% if label == '' %}
        {% for link in links %}
            
            <a href="{{ link['url'] }}">{{ link['description'] }}</a> ({{ link['domainName'] }})<br>
 
        {% endfor %}  
    {% else %}
        <strong> {{ label  }} </strong>
        <blockquote>
        {% for link in links %}
            
            <a href="{{ link['url'] }}">{{ link['description'] }}</a>  ({{ link['domainName'] }})<br>
 
        {% endfor %}
        </blockquote>
    {% endif %}
{% endfor %}
<h4>Doors</h4>
{% for door in doors %}
    <a href="{{ door['slug'] }}">{{ door['title'] }}</a> on floor <a href="/floor/{{ door['floor_name'] }}"> {{ door['floor_name'] }}</a><br>
{% endfor %}
{% endblock %}

#+end_src

** Delete Room

_Parameters_
- *room* a dict corresponding to the room schema see
- *success* a boolean flag which is true when the delete operation is
  executed and false otherwise. If the room has not yet been deleted,
  then the form will displayed, otherwise a message
#+begin_src html :tangle templates/delete.html
{% extends "base.html" %}
{% block title %} Delete Room {{ room['title'] }}{% endblock %}
{% block content %}
<h1> delete room "{{ room['title'] }}" </h1>
{% if not success %}
  <h3>THIS WILL PERMENANTLY DELETE THE ROOM</h3>
  <form method="POST" id="deleteform">
    <br>
    Password: <input type="text" name="password" value="">
    <input type="submit" value="Delete Room">
  </form>
{% else %}
  <p> Successfully deleted </p>
{% endif %}
{% if errors %}
    <h2>Errors:</h2>
    <blockquote>
      {% for error in errors %}
         <li> {{ error }} </li><br>
      {% endfor %}
    </blockquote>
{% endif %}
{% endblock %}

#+end_src


** Floor Template

_Parameters_
- *rooms* a list of dicts corresponding to the room schema see
- *floor\under{}name* string corresponding to the floor\under{}name
  field in the room table


#+begin_src html :tangle templates/floor_name.html
{% extends "base.html" %}
{% block title %}Floor {{ floor_name }}{% endblock %}
{% block content %}
<h1> you are on floor {{ floor_name }} </h1>
<h3>Here you can find the following rooms:</h3>
{% for room in rooms %}
    <a href="/room/{{ room['slug'] }}">{{ room['title'] }}</a><br>
{% endfor %}
{% endblock %}

#+end_src

** Discover
_Parameters_
- *floors* a list of strings
- *rooms* a list of dicts corresponding to the room schema see
- *links* a list of dicts with the keys {'url', 'description', 'domain'}

#+begin_src html :tangle templates/discover.html
{% extends "base.html" %}
{% block title %} Discover {% endblock %}
{% block content %}
<h1> discover </h1>
<form method="POST" id="discoverform">
  <br>
  containing the domain: <input type="text" name="domain" value="">
  <input type="submit" value="discover!">
</form>
<br>
(the <strong>domain</strong> is the part of the url displayed in parenthesis after each link)
<br><br>
<strong>floors</strong>
<blockquote>
  {% for floor in floors %}
    <a href="/floor/{{ floor }}">{{ floor }}</a><br>
  {% endfor %}
</blockquote>
<strong>rooms</strong>
<blockquote>
  {% for room in rooms %}
    <a href="/room/{{ room['slug'] }}">{{ room['title'] }}</a><br>
  {% endfor %}
</blockquote>

<strong>links</strong>
<blockquote>
  {% for link in links %}
    <a href="{{ link['url'] }}">{{ link['description'] }}</a> ({{ link['domainName'] }}) <br>
  {% endfor %}
</blockquote>


{% endblock %}

#+end_src

