linktower.html

<div id="outline-container-org19dcfcc" class="outline-4">
<h4 id="org19dcfcc"><span class="section-number-4">6.2.1.</span> New Form</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
<span class="underline">Parameters</span>
</p>
<ul class="org-ul">
<li><b>floor_name</b> the raw text from the floor_name input box</li>
<li><b>password</b> the raw text from the password input box</li>
</ul>

<div class="org-src-container">
<pre class="src src-html">{% extends "form.html" %}
{% block title %} new room {% endblock %}
{% block header %} new room {% endblock %}
{% block fields %}
&lt;dl&gt;
  &lt;dt&gt; floor name: &lt;/dt&gt;
  &lt;dd&gt;&lt;input type="text" name="floor_name" value="{{ floor_name }}"&gt;&lt;/dd&gt;
  &lt;dt&gt;password (do &lt;strong&gt;not&lt;/strong&gt; lose, can't be recovered):&lt;/dt&gt;
  &lt;dd&gt;&lt;input type="text" name="password" value="{{ password }}"&gt;&lt;/dd&gt;
&lt;/dl&gt;
 
  
  
  
{% endblock %}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7dbaba" class="outline-4">
<h4 id="orge7dbaba"><span class="section-number-4">6.2.2.</span> Edit Form</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
<span class="underline">Parameters</span>
</p>
<ul class="org-ul">
<li><b>floor_name</b> the raw text from the floor_name input box</li>
<li><b>password</b> the raw text from the password input box</li>
<li><b>new_password</b> the raw text from the new_password input box</li>
</ul>

<div class="org-src-container">
<pre class="src src-html">{% extends "form.html" %}
{% block title %} edit room {% endblock %}
{% block header %} edit room {% endblock %}
{% block fields %}
  &lt;dl&gt;
    &lt;dt&gt;floor name: &lt;/dt&gt;
    &lt;dd&gt;&lt;input type="text" name="floor_name" value="{{ floor_name }}"&gt;&lt;/dd&gt;
    &lt;dt&gt;password:&lt;/dt&gt;
    &lt;dd&gt;&lt;input type="text" name="password" value="{{ password }}"&gt;&lt;/dd&gt;
    &lt;dt&gt;set new password (optional):&lt;/dt&gt;
    &lt;dd&gt;&lt;input type="text" name="new_password" value=""&gt;&lt;/dd&gt;
  &lt;/dl&gt;

   

{% endblock %}
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org1bddb25" class="outline-3">
<h3 id="org1bddb25"><span class="section-number-3">6.3.</span> Room Template</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Unlabeled links are rendered on the same indentation as labels, while
labeled links are indented relative to the labels. Recall that
unlabeled links are associated to the empty string in the
<code>labelToLinks</code> dict.
</p>

<p>
<span class="underline">Parameters</span>
</p>
<ul class="org-ul">
<li><b>room</b> a dict corresponding to the room schema see</li>
<li><b>labelToLinks</b> a dict of label =&gt; list(link) see</li>
<li><b>doors</b> list of room dicts</li>
</ul>


<div class="org-src-container">
<pre class="src src-html">{% extends "base.html" %}
{% block title %}{{ room['title'] }}{% endblock %}
{% block content %}
&lt;h1&gt; {{ room['title'] }} &lt;/h1&gt; 
on floor &lt;a href="/floor/{{ room['floor_name'] }}"&gt;{{ room['floor_name'] }}&lt;/a&gt;
&lt;p&gt;&lt;a href="/room/{{ room['slug'] }}/edit"&gt;edit&lt;/a&gt;
&lt;a href="/room/{{ room['slug'] }}/delete"&gt;delete&lt;/a&gt;&lt;/p&gt;
&lt;br&gt;
{% for label, links in labelToLinks.items() %}
    {% if label == '' %}
        {% for link in links %}
            
            &lt;a href="{{ link['url'] }}"&gt;{{ link['description'] }}&lt;/a&gt; ({{ link['domainName'] }})&lt;br&gt;
 
        {% endfor %}  
    {% else %}
        &lt;strong&gt; {{ label  }} &lt;/strong&gt;
        &lt;blockquote&gt;
        {% for link in links %}
            
            &lt;a href="{{ link['url'] }}"&gt;{{ link['description'] }}&lt;/a&gt;  ({{ link['domainName'] }})&lt;br&gt;
 
        {% endfor %}
        &lt;/blockquote&gt;
    {% endif %}
{% endfor %}
&lt;h4&gt;Doors&lt;/h4&gt;
{% for door in doors %}
    &lt;a href="{{ door['slug'] }}"&gt;{{ door['title'] }}&lt;/a&gt; on floor &lt;a href="/floor/{{ door['floor_name'] }}"&gt; {{ door['floor_name'] }}&lt;/a&gt;&lt;br&gt;
{% endfor %}
{% endblock %}

</pre>
</div>
</div>
</div>

<div id="outline-container-orgb103cc1" class="outline-3">
<h3 id="orgb103cc1"><span class="section-number-3">6.4.</span> Delete Room</h3>
<div class="outline-text-3" id="text-6-4">
<p>
<span class="underline">Parameters</span>
</p>
<ul class="org-ul">
<li><b>room</b> a dict corresponding to the room schema see</li>
<li><b>success</b> a boolean flag which is true when the delete operation is
executed and false otherwise. If the room has not yet been deleted,
then the form will displayed, otherwise a message</li>
</ul>
<div class="org-src-container">
<pre class="src src-html">{% extends "base.html" %}
{% block title %} Delete Room {{ room['title'] }}{% endblock %}
{% block content %}
&lt;h1&gt; delete room "{{ room['title'] }}" &lt;/h1&gt;
{% if not success %}
  &lt;h3&gt;THIS WILL PERMENANTLY DELETE THE ROOM&lt;/h3&gt;
  &lt;form method="POST" id="deleteform"&gt;
    &lt;br&gt;
    Password: &lt;input type="text" name="password" value=""&gt;
    &lt;input type="submit" value="Delete Room"&gt;
  &lt;/form&gt;
{% else %}
  &lt;p&gt; Successfully deleted &lt;/p&gt;
{% endif %}
{% if errors %}
    &lt;h2&gt;Errors:&lt;/h2&gt;
    &lt;blockquote&gt;
      {% for error in errors %}
         &lt;li&gt; {{ error }} &lt;/li&gt;&lt;br&gt;
      {% endfor %}
    &lt;/blockquote&gt;
{% endif %}
{% endblock %}

</pre>
</div>
</div>
</div>


<div id="outline-container-orgddad503" class="outline-3">
<h3 id="orgddad503"><span class="section-number-3">6.5.</span> Floor Template</h3>
<div class="outline-text-3" id="text-6-5">
<p>
<span class="underline">Parameters</span>
</p>
<ul class="org-ul">
<li><b>rooms</b> a list of dicts corresponding to the room schema see</li>
<li><b>floor_name</b> string corresponding to the floor_name
field in the room table</li>
</ul>


<div class="org-src-container">
<pre class="src src-html">{% extends "base.html" %}
{% block title %}Floor {{ floor_name }}{% endblock %}
{% block content %}
&lt;h1&gt; you are on floor {{ floor_name }} &lt;/h1&gt;
&lt;h3&gt;Here you can find the following rooms:&lt;/h3&gt;
{% for room in rooms %}
    &lt;a href="/room/{{ room['slug'] }}"&gt;{{ room['title'] }}&lt;/a&gt;&lt;br&gt;
{% endfor %}
{% endblock %}

</pre>
</div>
</div>
</div>

<div id="outline-container-orge841e12" class="outline-3">
<h3 id="orge841e12"><span class="section-number-3">6.6.</span> Discover</h3>
<div class="outline-text-3" id="text-6-6">
<p>
<span class="underline">Parameters</span>
</p>
<ul class="org-ul">
<li><b>floors</b> a list of strings</li>
<li><b>rooms</b> a list of dicts corresponding to the room schema see</li>
<li><b>links</b> a list of dicts with the keys {'url', 'description', 'domain'}</li>
</ul>

<div class="org-src-container">
<pre class="src src-html">{% extends "base.html" %}
{% block title %} Discover {% endblock %}
{% block content %}
&lt;h1&gt; discover &lt;/h1&gt;
&lt;form method="POST" id="discoverform"&gt;
  &lt;br&gt;
  containing the domain: &lt;input type="text" name="domain" value=""&gt;
  &lt;input type="submit" value="discover!"&gt;
&lt;/form&gt;
&lt;br&gt;
(the &lt;strong&gt;domain&lt;/strong&gt; is the part of the url displayed in parenthesis after each link)
&lt;br&gt;&lt;br&gt;
&lt;strong&gt;floors&lt;/strong&gt;
&lt;blockquote&gt;
  {% for floor in floors %}
    &lt;a href="/floor/{{ floor }}"&gt;{{ floor }}&lt;/a&gt;&lt;br&gt;
  {% endfor %}
&lt;/blockquote&gt;
&lt;strong&gt;rooms&lt;/strong&gt;
&lt;blockquote&gt;
  {% for room in rooms %}
    &lt;a href="/room/{{ room['slug'] }}"&gt;{{ room['title'] }}&lt;/a&gt;&lt;br&gt;
  {% endfor %}
&lt;/blockquote&gt;

&lt;strong&gt;links&lt;/strong&gt;
&lt;blockquote&gt;
  {% for link in links %}
    &lt;a href="{{ link['url'] }}"&gt;{{ link['description'] }}&lt;/a&gt; ({{ link['domainName'] }}) &lt;br&gt;
  {% endfor %}
&lt;/blockquote&gt;


{% endblock %}

</pre>
</div>
</div>
</div>
