linktower.org
** Homepage

#+begin_src html :tangle templates/index.html
{% extends "base.html" %}
{% block title %}linktower{% endblock %}
{% block content %}
<h1>home</h1>

<h4>what</h4>

<ul>
  <li>linktower is a pastebin for links only.</li>
  <li>a "room" is a collection of links.</li>
  <li>a "floor" is a collection of rooms.</li>
  <li><a href="/new">"new"</a> to make your own.</li>
  <li><a href="/discover">"discover"</a> to browse.</li>
</ul>

<h4>why</h4>
<ul>
  <li>more explorable than a typical pastebin site</li>
  <li>minimalist <a href="/source">design</a></li>
  <li>fully documented <a href="/source">source code</a></li>
  <li>no registration</li>
  <li>no tracking</li>
  <li>i like lists</li>
</ul>

<h4>how</h4>
<ul>
  <li>python + flask + sqlite + html</li>
  <li><a href="https://orgmode.org/">org mode</a></li>
  <li><a href="http://literateprogramming.com">literate programming</a></li>
</ul>

<h4>rules</h4>
<ul>
  <li>don't link to anything illegal</li>
  <li>no spamming</li>
  <li>no nsfw</li>
  <li><a href="/license">license</a></li>
</ul>

<h4>get</h4>
<ul>
  <li><a href="/source">org file w/code + docs</a></li>
</ul>
{% endblock %}
#+end_src

** Help
#+begin_src html :tangle templates/help.html
{% extends "base.html" %}
{% block title %}linktower{% endblock %}
{% block content %}
<h1>help</h1>

<h4>example</h4>
<blockquote>
[unlabeled link](https://example.com/)<br>
Label1:<br>
[link for label1](https://example.com/links_must_be_unique)<br>
[2nd link for label1](https://example.com/but_domains_can_repeat)<br>
Labels can have spaces:<br>
<br>
<br>
[link for Labels can have spaces](https://example.com/blank_lines_are_ignored)<br>
Labels with no links are ignored:<br>
</blockquote>

<h4>constraints</h4>
<ul>
  <li> 1000 links+labels per room </li>
  <li> 150 characters per link description </li>
  <li> 100 characters per label </li>
  <li> 300 characters per room title </li>
  <li> 100 characters per floor name </li>
  <li> floor names are ascii only, no spaces </li>
</ul>



{% endblock %}
#+end_src


** Error page

#+begin_src html :tangle templates/not_found.html
{% extends "base.html" %}
{% block title %} not found {% endblock %}
{% block content%}
<h1>Error</h1>
{{ msg }} not found
{% endblock %}
#+end_src
