linktower.html

<div id="outline-container-org2a851a7" class="outline-3">
<h3 id="org2a851a7"><span class="section-number-3">6.7.</span> Homepage</h3>
<div class="outline-text-3" id="text-6-7">
<div class="org-src-container">
<pre class="src src-html">{% extends "base.html" %}
{% block title %}linktower{% endblock %}
{% block content %}
&lt;h1&gt;home&lt;/h1&gt;

&lt;h4&gt;what&lt;/h4&gt;

&lt;ul&gt;
  &lt;li&gt;linktower is a pastebin for links only.&lt;/li&gt;
  &lt;li&gt;a "room" is a collection of links.&lt;/li&gt;
  &lt;li&gt;a "floor" is a collection of rooms.&lt;/li&gt;
  &lt;li&gt;&lt;a href="/new"&gt;"new"&lt;/a&gt; to make your own.&lt;/li&gt;
  &lt;li&gt;&lt;a href="/discover"&gt;"discover"&lt;/a&gt; to browse.&lt;/li&gt;
&lt;/ul&gt;

&lt;h4&gt;why&lt;/h4&gt;
&lt;ul&gt;
  &lt;li&gt;more explorable than a typical pastebin site&lt;/li&gt;
  &lt;li&gt;minimalist &lt;a href="/source"&gt;design&lt;/a&gt;&lt;/li&gt;
  &lt;li&gt;fully documented &lt;a href="/source"&gt;source code&lt;/a&gt;&lt;/li&gt;
  &lt;li&gt;no registration&lt;/li&gt;
  &lt;li&gt;no tracking&lt;/li&gt;
  &lt;li&gt;i like lists&lt;/li&gt;
&lt;/ul&gt;

&lt;h4&gt;how&lt;/h4&gt;
&lt;ul&gt;
  &lt;li&gt;python + flask + sqlite + html&lt;/li&gt;
  &lt;li&gt;&lt;a href="https://orgmode.org/"&gt;org mode&lt;/a&gt;&lt;/li&gt;
  &lt;li&gt;&lt;a href="http://literateprogramming.com"&gt;literate programming&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;h4&gt;rules&lt;/h4&gt;
&lt;ul&gt;
  &lt;li&gt;don't link to anything illegal&lt;/li&gt;
  &lt;li&gt;no spamming&lt;/li&gt;
  &lt;li&gt;no nsfw&lt;/li&gt;
  &lt;li&gt;&lt;a href="/license"&gt;license&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;

&lt;h4&gt;get&lt;/h4&gt;
&lt;ul&gt;
  &lt;li&gt;&lt;a href="/source"&gt;org file w/code + docs&lt;/a&gt;&lt;/li&gt;
&lt;/ul&gt;
{% endblock %}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb69c88d" class="outline-3">
<h3 id="orgb69c88d"><span class="section-number-3">6.8.</span> Help</h3>
<div class="outline-text-3" id="text-6-8">
<div class="org-src-container">
<pre class="src src-html">{% extends "base.html" %}
{% block title %}linktower{% endblock %}
{% block content %}
&lt;h1&gt;help&lt;/h1&gt;

&lt;h4&gt;example&lt;/h4&gt;
&lt;blockquote&gt;
[unlabeled link](https://example.com/)&lt;br&gt;
Label1:&lt;br&gt;
[link for label1](https://example.com/links_must_be_unique)&lt;br&gt;
[2nd link for label1](https://example.com/but_domains_can_repeat)&lt;br&gt;
Labels can have spaces:&lt;br&gt;
&lt;br&gt;
&lt;br&gt;
[link for Labels can have spaces](https://example.com/blank_lines_are_ignored)&lt;br&gt;
Labels with no links are ignored:&lt;br&gt;
&lt;/blockquote&gt;

&lt;h4&gt;constraints&lt;/h4&gt;
&lt;ul&gt;
  &lt;li&gt; 1000 links+labels per room &lt;/li&gt;
  &lt;li&gt; 150 characters per link description &lt;/li&gt;
  &lt;li&gt; 100 characters per label &lt;/li&gt;
  &lt;li&gt; 300 characters per room title &lt;/li&gt;
  &lt;li&gt; 100 characters per floor name &lt;/li&gt;
  &lt;li&gt; floor names are ascii only, no spaces &lt;/li&gt;
&lt;/ul&gt;



{% endblock %}
</pre>
</div>
</div>
</div>


<div id="outline-container-orga757ef7" class="outline-3">
<h3 id="orga757ef7"><span class="section-number-3">6.9.</span> Error page</h3>
<div class="outline-text-3" id="text-6-9">
<div class="org-src-container">
<pre class="src src-html">{% extends "base.html" %}
{% block title %} not found {% endblock %}
{% block content%}
&lt;h1&gt;Error&lt;/h1&gt;
{{ msg }} not found
{% endblock %}
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
